; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v9 ?v3)
             (pred_8 ?v11 ?v13)
             (pred_4 ?v9 ?v13)
             (pred_6 ?v4 ?v9 )
	     (pred_11 ?v9)
             (pred_9 ?v6)
             (pred_5 ?v11)
             (pred_3 ?v13)
             (pred_2 ?v9)
             (pred_1 ?v11)
             (pred_12 ?v9)
             (pred_10 ))



(:action op_5
:parameters (?v10 ?v5 ?v1 ?v7)
:precondition (and (pred_9 ?v10) (pred_9 ?v5) (pred_5 ?v1) (pred_3 ?v7)
          (pred_7 ?v10 ?v5) (pred_8 ?v1 ?v7)
                   (pred_4 ?v5 ?v7) (pred_11 ?v10) 
                   (pred_2 ?v5) (pred_1 ?v1))
:effect (and  (pred_12 ?v5) (not (pred_2 ?v5))))


(:action op_4
:parameters (?v10 ?v8)
:precondition (and (pred_9 ?v10) (pred_9 ?v8)
               (pred_11 ?v10) (pred_7 ?v10 ?v8) (pred_12 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v10))))

(:action op_1
:parameters (?v10 ?v1)
:precondition (and (pred_9 ?v10) (pred_5 ?v1) 
                  (pred_11 ?v10) (pred_6 ?v1 ?v10) (pred_10 ))
:effect (and (pred_1 ?v1)
   (not (pred_6 ?v1 ?v10)) (not (pred_10 ))))


(:action op_2
:parameters (?v10 ?v2 ?v12)
:precondition (and (pred_9 ?v10) (pred_5 ?v2) (pred_5 ?v12)
                  (pred_11 ?v10) (pred_1 ?v12) (pred_6 ?v2 ?v10))
:effect (and (pred_1 ?v2) (pred_6 ?v12 ?v10)
        (not (pred_1 ?v12)) (not (pred_6 ?v2 ?v10))))

(:action op_3
:parameters (?v10 ?v1)
:precondition (and (pred_9 ?v10) (pred_5 ?v1) 
                  (pred_11 ?v10) (pred_1 ?v1))
:effect (and (pred_10 ) (pred_6 ?v1 ?v10) (not (pred_1 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_17 obj_21 obj_05 obj_18 obj_22 obj_07 obj_01 obj_14 obj_09 obj_10 obj_11 obj_04 obj_12 obj_15 obj_19
    obj_08 obj_06 obj_03
    obj_20 obj_13 obj_02
    )

    (:init
       (pred_10)

       (pred_9 obj_16)
       (pred_9 obj_17)
       (pred_9 obj_21)
       (pred_9 obj_05)
       (pred_9 obj_18)
       (pred_9 obj_22)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_02)

       (pred_7 obj_16 obj_18)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_22 obj_09)
       (pred_7 obj_22 obj_07)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_09 obj_22)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_15)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_11)
       (pred_4  obj_15 obj_08)
       (pred_4  obj_17 obj_06)
       (pred_4  obj_11 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_18)
       (pred_12 obj_22)
       (pred_12 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_12)
       (pred_12 obj_19)

       (pred_8  obj_20 obj_08)
       (pred_8  obj_13 obj_06)
       (pred_8  obj_02 obj_03)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_13 obj_21)
       (pred_6 obj_02 obj_12)
       (pred_11 obj_12)
    )

    (:goal (and
       (pred_6 obj_20 obj_12)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_02 obj_21)
    ))
(:constraints
  (always (not (pred_11 obj_22)))
)
)

; plan
1. (op_4 obj_12 obj_09)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_09)
   goals met: 0 of 3
2. (op_1 obj_09 obj_20)
   deleted: (pred_6 obj_20 obj_09) (pred_10)
   added: (pred_1 obj_20)
   goals met: 0 of 3
3. (op_4 obj_09 obj_12)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_12)
   goals met: 0 of 3
4. (op_5 obj_12 obj_15 obj_20 obj_08)
   deleted: (pred_2 obj_15)
   added: (pred_12 obj_15)
   goals met: 0 of 3
5. (op_2 obj_12 obj_02 obj_20)
   deleted: (pred_1 obj_20) (pred_6 obj_02 obj_12)
   added: (pred_1 obj_02) (pred_6 obj_20 obj_12)
   goals met: 1 of 3
6. (op_4 obj_12 obj_15)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_15)
   goals met: 1 of 3
7. (op_4 obj_15 obj_10)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_10)
   goals met: 1 of 3
8. (op_4 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 1 of 3
9. (op_4 obj_07 obj_21)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_21)
   goals met: 1 of 3
10. (op_2 obj_21 obj_13 obj_02)
   deleted: (pred_1 obj_02) (pred_6 obj_13 obj_21)
   added: (pred_1 obj_13) (pred_6 obj_02 obj_21)
   goals met: 2 of 3
11. (op_4 obj_21 obj_07)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_07)
   goals met: 2 of 3
12. (op_4 obj_07 obj_10)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_10)
   goals met: 2 of 3
13. (op_4 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 2 of 3
14. (op_4 obj_09 obj_14)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_14)
   goals met: 2 of 3
15. (op_3 obj_14 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_10) (pred_6 obj_13 obj_14)
   goals met: 3 of 3
